//===================================================================

#include "课程设计.h"

//===================================================================

#define N 100		//随机得到的字符个数

//===================================================================
int exercise_1()
{
	//*****************************************************
	int i;			//计数器
	int n;			//计算字符数
	int m;			//存储器
	int c;			//存放字符
	char a[N];		//存放随机字符用于检查正误
	char b[N];		//存放用户输入的字符
	int right;		//计算正确个数
	int wrong;		//计算错误个数
	float l;		//计算正确率
	char choose;	//用户选择

	//*****************************************************
	i=0;
	n=0;
	m=0;
	c=0;
	right=0;
	wrong=0;
	l=0;

	//*****************************************************
	srand((unsigned)time(NULL));

	//*****************************************************
	//提示用户
	printf("☆欢迎使用《打字练习》软件v4.0☆\n");
	printf("请输入下方的字母\n");
	
	//*****************************************************
	//产生随机字符
	for (i=0;i<N;i++)
	{
		m=rand();
		c=(m/N)+'A';
		if ((c>='a'&&c<='z')||(c>='A'&&c<='Z'))
		{
			printf("%c",c);
			n++;
			a[n]=c;
		}
	}
	printf("\n");
	
	//*****************************************************
	//用户输入字符
	printf("请在下行输入字母\n");
	getchar();
	for (i=1;i<=n;i++)
	{
		b[i]=getchar();
		if (b[i]=='\n')
		{
			goto a;
		}
	}

	//*****************************************************
a:
	//将用户输入的字符与产生的字符比较
	printf("正在检验中,请稍后......\n");
	
	for (i=0;i<n;i++)
	{
		if (a[i]==b[i])
		{
			right++;
		}
		else
		{
			wrong++;
		}
	}

	//*****************************************************
	printf("字符总数为: %d 个\n",n);
	printf("正确个数为: %d 个\n",right);
	printf("错误个数为: %d 个\n",wrong);
	l=(float)((float)right/(float)n);
	printf("正确率为: %.2f \n",l);
	printf("谢谢!!!\n");

	//*****************************************************
b:
	printf("**********************\n");
	printf("*是否继续练习？      *\n");
	printf("*     1.继续练习     *\n");
	printf("*     2.返回主菜单   *\n");
	printf("*     3.退出         *\n");
	printf("**********************\n");

	
	scanf("%d",&choose);

	switch (choose)
	{
	case 1:
		{
			system("cls");
			exercise_1();
			break;
		}
	case 2:
		{
			system("cls");
			main();
			break;
		}
	case 3:
		{
			return 0;
		}
	default :
		{
			system("cls");
			printf("错误，请重新选择\n");
			goto b;
			break;
		}
	}
	return 0;
}
//===================================================================