//===================================================================

#include "课程设计.h"

//===================================================================
#define N 100

char a[N];		//存放数组
//===================================================================
//调用函数
int getword();
int chuli(int l,char a[]);

//===================================================================
int exercise_3()
{
	//*****************************************************
	int choose;		//用户选择

	//*****************************************************
part1:
	printf("☆欢迎使用《英文单词处理》软件v6.0☆\n");
	printf("*********************\n");
	printf("*1.从键盘输入单词   *\n");
	printf("*2.返回主菜单       *\n");
	printf("*3.退出             *\n");
	printf("*********************\n");

	printf("请输入您的选择：");
	scanf("%d",&choose);

	switch (choose)
	{
	case 1:
		{
			system("cls");
			getword();
			break;
		}
	case 2:
		{
			system("cls");
			main();
			break;
		}
	case 3:
		{
			goto end;
		}
	default :
		{
			system("cls");
			printf("选择错误！！！请重新选择\n");
			goto part1;
			break;
		}
	}
end:
	return 0;
}

//===================================================================
//从键盘输入
int getword()
{
	//*****************************************************
	int i;		//计数器

	//*****************************************************
	printf("请输入单词(以空格隔开，回车键结束(*回车键前需要一个空格)):\n");
	getchar();
	for (i=0;i<N;i++)
	{
		scanf("%c",&a[i]);
		if (a[i]=='\n')
		{
			chuli(i,a);
			break;
		}
	}
	return 0;
}

//===================================================================
//处理数据
int chuli(int i,char a[])
{
	//*****************************************************
	int n;			//计数器
	int m;			//计数器
	int length;		//单词长度
	int len[N];		//单词长度
	int s[N];		//单词头
	int max;		//最大长度
	int num;		//最长单词的位置

	//*****************************************************
	length=0;
	for (n=0,m=0;n<i;n++)
	{
		s[0]=0;
		length++;
		if (a[n]==' '||a[n]=='\n')
		{
			len[m]=length;		//存储每个单词的长度
			m++;
			s[m]=n+1;			//存储每个单词的首字母位置
			length=0;			//重置长度
		}
	}

	//*****************************************************
	max=len[0];
	num=0;
	for (n=1;n<m;n++)
	{
		
		if (max<len[n])
		{
			max=len[n];
			num=n;
		}
	}

	//*****************************************************
	printf("最长的单词为:");
	for (n=s[num];n<s[num+1];n++)
	{
		printf("%c",a[n]);	
	}
	printf("\n");
	printf("长度为 %d ",max);

	return 0;	
}

//===================================================================