//===================================================================

#include "课程设计.h"

//===================================================================

#define N 10		//存储的数组大小

int a[N];			//存放数字

//===================================================================
int exercise_2()
{
	//*****************************************************
head:
	//调用函数声明
	int ran();
	int man();
	
	//*****************************************************
	int choose;			//用户选择

	//*****************************************************
	choose=0;
	
	//*****************************************************
	//用户提示
	printf("☆欢迎使用《数据处理》软件v6.0☆\n");
	printf("请选择\n");
	printf("||=====================||\n");
	printf("||1.系统产生一组随机数 ||\n");
	printf("||2.自行输入一组数字   ||\n");
	printf("||=====================||\n");

	scanf("%d",&choose);

	//清空屏幕
	system("cls");

	//处理数据
	switch (choose)
	{
	case 1:
		{
			ran();
			break;
		}
	case 2:
		{
			man();
			break;
		}
	default:
		{
			system("cls");
			printf("选择错误!!!请重新选择\n");
			goto head;
		}
	}

	return 0;
}

//===================================================================
//随机数处理
int ran()
{
	//*****************************************************
	int i;			//计数器
	int choose;		//选择器

	//*****************************************************
	//调用函数声明
	void beave();
	void pai();

	srand((unsigned)time(NULL));

	//*****************************************************
	//用户提示
	printf("随机数输出如下\n");

	//输出随机数
	for (i=0;i<N;i++)
	{
		a[i]=rand()%100;
	}

a:	for (i=0;i<N;i++)
	{
		printf("%d ",a[i]);
	}

	//*****************************************************
	//用户选择
	printf("\n");
	printf("请选择执行下述操作\n");
	printf("*********************************\n");
	printf("*1.求最大数和最小数             *\n");
	printf("*2.求出输出所有高于平均值得数据 *\n");
	printf("*3.排序                         *\n");
	printf("*4.退出                         *\n");
	printf("*********************************\n");

	scanf("%d",&choose);

	switch (choose)
	{
	case 1:
		{
			pai();
			printf("最大值为%d\n",a[N-1]);
			printf("最小值为%d\n",a[0]);
			break;
		}
	case 2:
		{
			beave();
			break;
		}
	case 3:
		{
			pai();
			printf("按从小到大排列如下\n");
			for (i=0;i<N;i++)
			{
				printf("%d ",a[i]);
			}
			printf("\n");
			break;
		}
	case 4:
		{
			goto d;
			break;
		}
	default :
		{
			system("cls");
			printf("错误！！请重新选择");
			goto a;
			break;
		}
	}

	//*****************************************************
b:
	printf("*********************\n");
	printf("*是否继续处理?      *\n");
	printf("*1.继续处理该组数据 *\n");
	printf("*2.返回数据处理     *\n");
	printf("*3.返回主菜单       *\n");
	printf("*4.退出             *\n");
	printf("*********************\n");

	scanf("%d",&choose);

	switch (choose)
	{
	case 1:
		{
			goto a;
		}
	case 2:
		{
			system("cls");
			exercise_2();
			break;
		}
	case 3:
		{
			system("cls");
			main();
			break;
		}
	case 4:
		{
			goto d;
			break;
		}
	default :
		{
			system("cls");
			printf("错误！！请重新输入");
			goto b;
			break;
		}
	}
d:
	return 0;
}


//===================================================================
//处理人工数据
int man()
{
	//*****************************************************
	int i;			//计数器
	int choose;		//选择器

	//*****************************************************
	//调用函数
	int main();
	void max();
	void min();
	void beave();
	void pai();

	//*****************************************************
	//用户提示
	printf("请输入您的数据(10个)\n");
	
	//获取数据
	for (i=0;i<N;i++)
	{
		scanf("%d",&a[i]);
	}

	system("cls");

	//*****************************************************
a:
	//输出数据
	printf("您输入的数据如下\n");
	for (i=0;i<N;i++)
	{
		printf("%d ",a[i]);
	}

	//*****************************************************
	//用户选择
	printf("\n");
	printf("请选择执行下述操作\n");
	printf("*********************************\n");
	printf("*1.求最大数和最小数             *\n");
	printf("*2.求出输出所有高于平均值得数据 *\n");
	printf("*3.排序                         *\n");
	printf("*4.退出                         *\n");
	printf("*********************************\n");

	scanf("%d",&choose);

	switch (choose)
	{
	case 1:
		{
			pai();
			printf("最大值为%d\n",a[N-1]);
			printf("最小值为%d\n",a[0]);
			break;
		}
	case 2:
		{
			beave();
			break;
		}
	case 3:
		{
			pai();
			printf("按从小到大排列如下\n");
			for (i=0;i<N;i++)
			{
				printf("%d ",a[i]);
			}
			printf("\n");
			break;
		}
	case 4:
		{
			goto d;
			break;
		}
	default :
		{
			system("cls");
			printf("错误！！请重新选择");
			goto a;
			break;
		}
	}

	//*****************************************************
b:
	printf("*********************\n");
	printf("*是否继续处理?      *\n");
	printf("*1.继续处理该组数据 *\n");
	printf("*2.返回数据处理     *\n");
	printf("*3.返回主菜单       *\n");
	printf("*4.退出             *\n");
	printf("*********************\n");

	scanf("%d",&choose);

	switch (choose)
	{
	case 1:
		{
			goto a;
		}
	case 2:
		{
			system("cls");
			exercise_2();
			break;
		}
	case 3:
		{
			system("cls");
			main();
			break;
		}
	case 4:
		{
			goto d;
			break;
		}
	default :
		{
			system("cls");
			printf("错误！！请重新输入");
			goto b;
			break;
		}
	}
d:
	return 0;
}

//===================================================================
//输出所有大于平均值的数
void beave()
{
	//*****************************************************
	int sum;		//存放总和
	float ave;		//存放平均值
	int i;			//计数器

	//*****************************************************
	sum=0;

	//*****************************************************
	for (i=0;i<N;i++)
	{
		sum+=a[i];
	}

	//*****************************************************
	ave=(float)(sum/N);
	printf("平均数为: %.2f \n",ave);
	printf("所有高于平均数的数输出如下\n");
	for (i=0;i<N;i++)
	{
		if (a[i]>(int)ave)
		{
			printf("%d ",a[i]);
		}
	}
	printf("\n");
}

//===================================================================
//排序
void pai()
{
	//*****************************************************
	int n;//计数器
	int i;//计数器
	int t;//转换器

	//*****************************************************
	for (i=0;i<N;i++)
	{
		for (n=i;n<N;n++)
		{
			if (a[i]>a[n])
			{
				t=a[i];
				a[i]=a[n];
				a[n]=t;
			}
		}
	}
}

//===================================================================